package d3prob;

/*
1. 1월 1일의 요일이 정수,
2. 2월 29일의 유무가 불린

으로 주어진다.

이때 1월 1일의 요일은,
```
String[] days = {}
0 - 월요일, 1 - 화요일, 2 - 수요일, 3 - 목요일, 4 - 금요일, 5 - 토요일, 6 - 일요일
```
으로 입력된다.

각 달의 1일이 무슨 요일인지 1월부터 12월까지 순서대로 출력하는 코드를 작성하시오.

 */
public class H6Control {
    // 1월 1일이 무슨 요일인지
    // 2월이 28일인지 29인지
    // 1 ~ 7 사이에는 (for)
    // 홀수달이 31일 짝수달이 30일, 2월은 별도 (if else)
    // 요일을 구하는 자체는 % 7
    // 8 ~ 12 사이에는 (for)
    // 홀수달이 30일 짝수달이 31일 (if else)

    // 요일을 출력하는 것은 숫자와 같은곳에 해당하는 요일이 저장된 문자열 배열을 활용하는 것을 추천
}
